# location-processor - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/location_processor_cusstomer_v1_event]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/location_processor_cusstomer_v1_event_retry_0]
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role.lambda_role: Refreshing state... [id=le-location_processor_cusstomer_v1_event_retry_0]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role.lambda_role: Refreshing state... [id=le-location_processor_cusstomer_v1_event]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=d8a7046f-2604-4b33-94b0-0ffbf472b6c9:location_processor]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Read complete after 0s [id=upstash_kafka_credential_secret_name]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Reading...
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Read complete after 1s [id=arn:aws:secretsmanager:us-east-1:064003852748:secret:upstash_kafka_credential_419430-wUkmg8]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=2649218447]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=2649218447]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy_attachment.default: Refreshing state... [id=le-location_processor_cusstomer_v1_event_retry_0-20230527203911903600000002]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-location_processor_cusstomer_v1_event_retry_0:lambda-secrets-policy-location_processor_cusstomer_v1_event_retry_0]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-location_processor_cusstomer_v1_event:lambda-secrets-policy-location_processor_cusstomer_v1_event]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-location_processor_cusstomer_v1_event-20230527203911715800000001]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 1s [id=upstash-cluster-f627d8e0-ce7f-453a-82f7-d74842bcb5da]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 1s [id=upstash-kafka-credential-86956032-29ef-4f76-8155-c39f14e699c8]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Read complete after 2s [id=4f347b642745e43729db03ff5e7107f3bde6ff66]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_lambda_function.default: Refreshing state... [id=location_processor_cusstomer_v1_event_retry_0]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_retry_topics[0]: Refreshing state... [id=5d9fc628-47f5-438d-b0c4-90e8634c58ba]
module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Read complete after 2s [id=724529be3c55ccfd8080258ef0db0f08986bddd5]
module.common_resources.module.aws_lambda_customer_v1_event.aws_lambda_function.default: Refreshing state... [id=location_processor_cusstomer_v1_event]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_topic: Refreshing state... [id=a3b303ea-977a-440d-931f-6cf44ccb3aa4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda_customer_v1_event.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "location_processor_cusstomer_v1_event"
      ~ last_modified                  = "2023-06-04T09:01:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "d8qltMLBweJ6Dr6UJsFWO4nkVk0GkFXKbZ9VGi2ykZg=" -> "3PD1cUvz8WuX12J3spArut5RZFplkvhMvA1mX778kOg="
        tags                           = {
            "domain"        = "location"
            "environment"   = "production"
            "resource"      = "location-processor"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "oriented-mongoose-7714-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "211d089e15874b9489b18667958dca1e"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "b3JpZW50ZWQtbW9uZ29vc2UtNzcxNCSR9CEq4XqSjhBrNb6qCFJ3mdmx_t8V1TA"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "location_processor_cusstomer_v1_event_retry_0"
      ~ last_modified                  = "2023-06-04T09:01:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "d8qltMLBweJ6Dr6UJsFWO4nkVk0GkFXKbZ9VGi2ykZg=" -> "8BtqYcYrgwcy/9UfAmXw+hIozL71iEMb9pgexUIHrYA="
        tags                           = {
            "domain"        = "location"
            "environment"   = "production"
            "resource"      = "location-processor"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "oriented-mongoose-7714-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "211d089e15874b9489b18667958dca1e"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "b3JpZW50ZWQtbW9uZ29vc2UtNzcxNCSR9CEq4XqSjhBrNb6qCFJ3mdmx_t8V1TA"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "location"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "location_processor"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "d8a7046f-2604-4b33-94b0-0ffbf472b6c9:location_processor"
        name       = "location_processor"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "77d5e540-632c-45df-909c-750205e29612" -> "bd865ff0-e5ee-41ec-9b69-d5166503947c"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*